@copilot Please identify and fix the following error:

```
bash-4.4$ terraform apply
data.catalystcenter_network_device_by_ip.wired_device[0]: Reading...
data.catalystcenter_network_device_by_ip.site_assign[0]: Reading...
data.catalystcenter_sites.target_site: Reading...
data.catalystcenter_sites.target_site: Read complete after 0s [id=1755622267]
data.catalystcenter_network_device_by_ip.site_assign[0]: Read complete after 0s [id=1755622267]
data.catalystcenter_network_device_by_ip.wired_device[0]: Read complete after 0s [id=1755622267]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # catalystcenter_provisioning_settings.global_settings will be created
  + resource "catalystcenter_provisioning_settings" "global_settings" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + require_itsm_approval = "false"
          + require_preview       = "false"
        }
    }

  # terraform_data.validation will be created
  + resource "terraform_data" "validation" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + application_telemetry_status = {
      + device_ips      = [
          + "204.101.96.1",
          + "204.101.96.2",
        ]
      + enabled         = true
      + status          = "Telemetry configuration ready (manual setup required)"
      + wired_config    = {
          + telemetry = "enable"
        }
      + wireless_config = {
          + include_guest_ssid = true
          + telemetry          = "enable"
          + wlan_mode          = "LOCAL"
        }
    }
  + provision_test_results       = {
      + configuration_status = {
          + debug_enabled                 = true
          + provisioning_settings_applied = true
          + site_configured               = true
          + timeouts_configured           = true
        }
      + enabled_workflows    = [
          + "site_assignment",
          + "wired_provision",
          + null,
          + null,
        ]
      + recommendations      = []
      + validation_passed    = true
    }
  + provision_workflow_summary   = {
      + device_ips              = [
          + "204.101.96.1",
          + "204.101.96.2",
        ]
      + next_steps              = [
          + "Verify device status in Catalyst Center UI under Inventory > Devices",
          + "Check provisioning status under Provision > Device Provision",
          + "Monitor device connectivity and configuration compliance",
          + "Configure application telemetry manually if needed",
        ]
      + operations_summary      = {
          + devices_provisioned   = 1
          + re_provisions         = 0
          + site_assignments_only = 1
          + wired_provisions      = 1
          + wireless_provisions   = 0
        }
      + site_hierarchy          = "Global/USA/SAN JOSE/SJ_BLD23"
      + total_devices_processed = 2
    }
  + provisioning_settings        = {
      + id                    = (known after apply)
      + last_updated          = (known after apply)
      + require_itsm_approval = (known after apply)
      + require_preview       = (known after apply)
    }
╷
│ Error: Invalid index
│ 
│   on main.tf line 45, in resource "catalystcenter_sda_provision_devices" "site_assignment":
│   45:       site_id          = data.catalystcenter_sites.target_site.items[0].id
│     ├────────────────
│     │ data.catalystcenter_sites.target_site.items is empty list of object
│ 
│ The given key does not identify an element in this collection value: the collection has no elements.
╵
╷
│ Error: Invalid index
│ 
│   on main.tf line 72, in resource "catalystcenter_sda_provision_devices" "wired_provision":
│   72:       site_id          = data.catalystcenter_sites.target_site.items[0].id
│     ├────────────────
│     │ data.catalystcenter_sites.target_site.items is empty list of object
│ 
│ The given key does not identify an element in this collection value: the collection has no elements.
╵
bash-4.4$ 
```